Revit 2024 API
RebarShapeDrivenAccessor.MultiplanarDepth Property
 For a multiplanar rebar, the depth of the instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double MultiplanarDepth { get; set; }
Visual Basic
Public Property MultiplanarDepth As Double
	Get
	Set
Visual C++
public:
property double MultiplanarDepth {
	double get ();
	void set (double value);
}
Remarks
 Applicable only when an instance of a RebarShape with a RebarShapeMultiplanarDefinition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: multiplanarDepth must be positive.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarShapeDrivenAccessor is not an instance of a multiplanar shape. -or- This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace